#include <iostream>
#include <ctime>

using namespace std;

int linesearch(int arr[], int x, int b, int key)
{
	for (x; x <= b; x++)
	{
		if (key == arr[x])
		{
			return x;
		}

	}
	return -1;
}

int doublesearch(int arr[], int x, int b, int key)
{
	int mid;
	bool flag = false;
	while ((x <= b) && (flag != true)) {
		mid = (x + b) / 2; // считываем срединный индекс отрезка [l,r]

		if (arr[mid] == key) flag = true; //проверяем ключ со серединным элементом
		if (arr[mid] > key) b = mid - 1; // проверяем, какую часть нужно отбросить
		else x = mid + 1;
	}
	return mid;
}


int main()
{
	int mas[100] = {- 996, -960, -944, -887, -865, -860, -846, -831, -790, -785, -700, -691, -662, -662, -647,
		-640, -587, -532, -524, -519, -501, -497, -475, -471, -461, -457, -452, -442, -441, -416,
		-412, -411, -390, -389, -358, -341, -306, -257, -253, -252, -248, -208, -143, -134, -82,
		-79, -11, 21, 26, 48, 68, 69, 72, 93, 95, 99, 115, 120, 156, 164, 181, 200, 231, 252, 288,
		304, 336, 343, 364, 402, 419, 486, 546, 584, 595, 596, 606, 627, 636, 666, 666, 683, 701,
		740, 766, 780, 782, 794, 802, 829, 832, 837, 858, 875, 881, 882, 883, 883, 947, 959};
	cout << doublesearch(mas, 0, 100, 120) << endl;
	cout << clock()/1000.0;

}